In [1]:
import pandas as pd
import numpy as np

In [19]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Yavuz","Furkan"] ,"Spor": ["Koşu","Yüzme","Kalistenik","Boks"],
           "Kalori": [100,200,300,400]}
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [20]:
dataFrame1

     Isim        Spor  Kalori
0   Ahmet        Koşu     100
1  Mehmet       Yüzme     200
2   Yavuz  Kalistenik     300
3  Furkan        Boks     400

In [21]:
sozluk2 = {"Isim" : ["Sam","Toni","Coni","Herkel"] ,"Spor": ["Koşu","Yüzme","Kalistenik","Boks"],
           "Kalori": [120,150,230,330]}
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [22]:
dataFrame2

     Isim        Spor  Kalori
4     Sam        Koşu     120
5    Toni       Yüzme     150
6    Coni  Kalistenik     230
7  Herkel        Boks     330

In [23]:
sozluk3 = {"Isim" : ["Joe","Avarel","Merkel","Rachel"] ,"Spor": ["Koşu","Yüzme","Kalistenik","Boks"],
           "Kalori": [110,130,170,130]}
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [24]:
dataFrame3

      Isim        Spor  Kalori
8      Joe        Koşu     110
9   Avarel       Yüzme     130
10  Merkel  Kalistenik     170
11  Rachel        Boks     130

In [25]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim        Spor  Kalori
0    Ahmet        Koşu     100
1   Mehmet       Yüzme     200
2    Yavuz  Kalistenik     300
3   Furkan        Boks     400
4      Sam        Koşu     120
5     Toni       Yüzme     150
6     Coni  Kalistenik     230
7   Herkel        Boks     330
8      Joe        Koşu     110
9   Avarel       Yüzme     130
10  Merkel  Kalistenik     170
11  Rachel        Boks     130

## merging

In [26]:
mergeSozluk1={"Isim": ["Ahmet","Mehmet","Ayşe","Fatma"] ,"Spor": ["Koşu","Yüzme","Koşu","Tenis"]}
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [27]:
mergeSozluk2={"Isim": ["Ahmet","Mehmet","Ayşe","Fatma"] ,"Kalori": [100,250,310,200]}
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [30]:
yeniMerge=pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim   Spor  Kalori
0   Ahmet   Koşu     100
1  Mehmet  Yüzme     250
2    Ayşe   Koşu     310
3   Fatma  Tenis     200

In [31]:
maasSozluk={ "Isim": ["Ahmet","Zeynep","Mehmet","Yavuz"], "Departman":["Yazilim","Insaat","Yazilim","Satis"],"Maas": [470,350,300,280]}
maasDataFrame=pd.DataFrame(maasSozluk)

In [32]:
maasDataFrame

     Isim Departman  Maas
0   Ahmet   Yazilim   470
1  Zeynep    Insaat   350
2  Mehmet   Yazilim   300
3   Yavuz     Satis   280

In [33]:
maasDataFrame["Departman"].unique()

array(['Yazilim', 'Insaat', 'Satis'], dtype=object)

In [34]:
maasDataFrame["Departman"].nunique()

3

In [44]:
maasDataFrame["Departman"].value_counts()

Departman
Yazilim    2
Insaat     1
Satis      1
Name: count, dtype: int64

In [48]:
def bruttenNete(maas) :
     return maas * 0.66

In [52]:
maasDataFrame["Maas"].apply(bruttenNete)

0    310.2
1    231.0
2    198.0
3    184.8
Name: Maas, dtype: float64

In [54]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [60]:
yeniBirVeri={"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson",], 
             "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
            "Karakter Yas": [9,10,50,20,10]}

In [61]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [62]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [64]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     15
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [66]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10